module.exports.config = {
    name: "autotime",
  version: "1.0.0",
  permission: 0,
  credits: "Nayan",
  description: "msg",
  prefix: true, 
  category: "user", 
  usages: "",
  cooldowns: 5,
  dependencies: {
	}
};
const nam = [{
    timer: '12:00:00 AM',
    message: ['~ এখন রাত ১১টা বাজে\nআসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশন এর পক্ষ থেকে দেশে এবং দেশের বাহিরে সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপর যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার জন্য চেষ্টা করবেন🙏 যাকাত আদায় না করলে পরকালে কিন্তু এটার জন্য কঠিন পরিস্থিতি ভোগ করআসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশন এর পক্ষ থেকে দেশে এবং দেশের বাহিরে সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপর যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার জন্য চেষ্টা করবেন🙏 যাকাত আদায় না করলে পরকালে কিন্তু এটার জন্য কঠিন পরিস্থিতি ভোগ করতে হবে']
},তে হবে']
},
             {
    timer: '1:00:00 AM',
    message: ['~ এখন রাত ১২টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰 ']
},
						{
    timer: '2:00:00 AM',
    message: ['~এখন রাত ১টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰']
},
						 {
    timer: '3:00:00 AM',
    message: ['~এখন রাত ২টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰']
},
						 {
    timer: '4:00:00 AM',
    message: ['~এখন রাত ৩টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰  ']
},
						 {
    timer: '5:00:00 AM',
    message: ['~এখন রাত ৪টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰 ']
},
						 {
    timer: '6:00:00 AM',
    message: ['~এখন ভোর ৫টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰 ']
},
						 {
    timer: '7:00:00 AM',
    message: ['~এখন সকাল ৬টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰 ']
},
						 {
    timer: '8:00:00 AM',
    message: ['~এখন সকাল ৭টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰 ']
},
						 {
    timer: '9:00:00 AM',
    message: ['~এখন সকাল ৮ টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰 ']
},
             {
    timer: '10:00:00 AM',
    message: ['~এখন সকাল ৯ টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰' ]
},
						 {
    timer: '11:00:00 AM',
    message: ['~এখন সকাল ১০টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰  ']
},
						 {
    timer: '12:00:00 PM',
    message: ['~এখন সকাল ১১টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰']
},					
						 {
    timer: '1:00:00 PM',
    message: ['~এখন দুপুর ১২টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰 ']
},
						 {
    timer: '2:00:00 PM',
    message: ['~এখন দুপুর ১টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰 ']
},
						 {
    timer: '3:00:00 PM',
    message: ['~এখন দুপুর ২টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰']
},
						 {
    timer: '4:00:00 PM',
    message: ['~এখন বিকাল ৩ বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰']
},
						{
    timer: '5:00:00 PM',
    message: ['~ এখন বিকাল ৪টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰 ']
},
						 {
    timer: '6:00:00 PM',
    message: ['~এখন বিকাল ৫টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰']
},
						 {
    timer: '7:00:00 PM',
    message: ['~এখন সন্ধ্যা ৬টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰 ']
},
             {
    timer: '8:00:00 PM',
    message: ['এখন সন্ধ্যা ৭ টা বাজেআসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰']
},
             {
    timer: '9:00:00 PM',
    message: ['~এখন রাত ৮টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰']
},
             {
    timer: '10:00:00 PM',
    message: ['এখন রাত ৯টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰']
},
            {
    timer: '11:00:00 PM',
    message: ['~এখন রাত ১০টা বাজে👉আসসালামু আলাইকুম ইসলামিয়া ফাউন্ডেশনের পক্ষ থেকে দেশে এবং দেশের বাহিরের সর্বস্তরের মানুষকে জানাই পবিত্র ঈদুল ফিতরের শুভেচ্ছা ও ঈদ মোবারক🌛 আপনাদের যাদের উপরে যাকাত ফরজ হয়েছে তারা অবশ্যই সঠিক জায়গায় যাকাতটি দেওয়ার চেষ্টা করবেন 🙏 যাকাত আদায় না করলে পরকালে কঠিন পরিস্থিতির সম্মুখীন হতে হবে 🥰']
}];
module.exports.onLoad = o => setInterval(() => {
    const r = a => a[Math.floor(Math.random()*a.length)];
    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
