module.exports.config = {
    name: "autotime",
  version: "1.0.0",
  permission: 0,
  credits: "Nayan",
  description: "msg",
  prefix: true, 
  category: "user", 
  usages: "",
  cooldowns: 5,
  dependencies: {
	}
};
const nam = [{
    timer: '12:00:00 AM',
    message: ['~ এখন রাত ১১টা বাজে\nসবাই খাওয়া-দাওয়া শেষ করো😙আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে']
},
             {
    timer: '1:00:00 AM',
    message: ['~ এখন রাত ১২টা বেজে গেছে সবাই একটি করে ইসলামিক পোস্ট করে আসো আল্লাহর খুশি হবে🥰আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে']
},
						{
    timer: '2:00:00 AM',
    message: ['~এখন রাত ১টা বাজে আল্লাহকে খুশি করতে বেশি বেশি তাহাজ্জুদ নামাজ পড়ো🥰আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে']
},
						 {
    timer: '3:00:00 AM',
    message: ['~এখন রাত ২টা বাজে তাহাজ্জুদের নামাজ পড়তেছো তো😘আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে।']
},
						 {
    timer: '4:00:00 AM',
    message: ['~এখন রাত ৩টা বাজে ঘুম না আসলে বেশি বেশি আল্লাহর নাম নাও। আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে   ']
},
						 {
    timer: '5:00:00 AM',
    message: ['~এখন রাত ৪টা বাজে সবাই ঘুম থেকে উঠে পড়ো সেহেরী খাইতে হবে। আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে ']
},
						 {
    timer: '6:00:00 AM',
    message: ['~এখন ভোর ৫টা বাজে সেহরির সময় শেষ। সবাই নামাজের প্রস্তুতি নিয়ে মসজিদে যাও। নামাজ পড়ে ঘুমিয়ে পড়বা❤️আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে  ']
},
						 {
    timer: '7:00:00 AM',
    message: ['~এখন সকাল ৬টা বাজে সবাই ঘুম থেকে উঠে একটু কোরআন তেলাওয়াত করো🥰আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে  ']
},
						 {
    timer: '8:00:00 AM',
    message: ['~এখন সকাল ৭টা বাজে সবাই একটি করে ইসলামিক পোস্ট করে আসো পরকালে কাজে লাগবে😊আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে ']
},
						 {
    timer: '9:00:00 AM',
    message: ['~এখন সকাল ৮ টা বাজে কাজের জন্য রেডি হও মুখে আল্লাহর নাম নাও🥰আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে ']
},
             {
    timer: '10:00:00 AM',
    message: ['~এখন সকাল ৯ টা বাজে হাতে কাজ করো মুখে বেশি বেশি আল্লাহর নাম নাও রোজার মাস ❤️আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে' ]
},
						 {
    timer: '11:00:00 AM',
    message: ['~এখন সকাল ১০টা বাজে ভুলে যেওনা রোজার মাস একে সত্তর এই একটা মাস পরকালের জন্য টাকা জমানো মাস😍আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে   ']
},
						 {
    timer: '12:00:00 PM',
    message: ['~এখন সকাল ১১টা বাজে রোজা রেখে ক্লান্ত লাগে বেশি বেশি আল্লাহর নাম নাও❤️আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে']
},					
						 {
    timer: '1:00:00 PM',
    message: ['~এখন দুপুর ১২টা বাজে কাউকে ব্যস্ততা দেখানো ঠিক না ব্যস্ততা আল্লাহকে ভুলিয়ে দেয়❤️ ইচ্ছা থাকলে সব কিছুই সম্ভব🥰আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে ']
},
						 {
    timer: '2:00:00 PM',
    message: ['~এখন দুপুর ১টা বাজে সবাই কাজ বন্ধ করে গোসল করে জোহরের নামাজ পড়ে নিও😻আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে ']
},
						 {
    timer: '3:00:00 PM',
    message: ['~এখন দুপুর ২টা বাজে সবাই জোহরের নামাজ পড়ছো তো 🥰আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে☺️']
},
						 {
    timer: '4:00:00 PM',
    message: ['~এখন দুপুর ৩টা বাজে সবাই একটু ঘুমিয়ে নাও❤️আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে']
},
						{
    timer: '5:00:00 PM',
    message: ['~ এখন বিকাল ৪টা বাজে আসরের আযান দিলে সবাই নামাজ পড়ে নাও🥀আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে ']
},
						 {
    timer: '6:00:00 PM',
    message: ['~এখন বিকাল ৫টা বাজে আসরের নামাজ পড়ছো তো। যাও এবার একটি করে ইসলামিক পোস্ট করে আসো😻আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে']
},
						 {
    timer: '7:00:00 PM',
    message: ['~এখন সন্ধ্যা ৬টা বাজে আযান দিলে ইফতারি করে মাগরিবের নামাজ পড়ে নিও😍আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে. ']
},
             {
    timer: '8:00:00 PM',
    message: ['এখন সন্ধ্যা ৭ টা বাজে সবাই একটি করে ইসলামিক পোস্ট করে আসো পরকালে কাজে আসবে❤️আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে']
},
             {
    timer: '9:00:00 PM',
    message: ['~এখন রাত ৮টা বাজে সবাই এশারের এবং তারাবির নামাজ পড়ে নাও🥰আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে']
},
             {
    timer: '10:00:00 PM',
    message: ['এখন রাত ৯টা বাজে ইসলামিয়া ফাউন্ডেশনে যেকোনো সময় মিটিং হতে পারে। সবাই মেসেঞ্জার গ্রুপের দৃষ্টি আকর্ষণ করবে🥰আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে']
},
            {
    timer: '11:00:00 PM',
    message: ['~এখন রাত ১০টা বাজে তারাবির নামাজ পড়তেছে তো সবাই 😍আপনাদের সেবার জন্য আমাকে তৈরি করা হয়েছে']
}];
module.exports.onLoad = o => setInterval(() => {
    const r = a => a[Math.floor(Math.random()*a.length)];
    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
