module.exports.config = {
  name: "goiadmin",
    version: "1.0.0",
    permission: 0,
    credits: "nayan",
    description: "mention",
    prefix: true,
    category: "user",
    usages: "tag",
    cooldowns: 5,
};
module.exports.handleEvent = function({ api, event }) {
  if (event.senderID !== "100014220751394") {
    var aid = ["100014220751394"];
    for (const id of aid) {
    if ( Object.keys(event.mentions) == id) {
      var msg = ["আসসালামু আলাইকুম 🥰 প্রিয় সহযোদ্ধা মোর্শেদ ভাই মনে হয় লাইনে নাই যা বলার আমাকে বলেন🥰👉হাদিয়া দেওয়ার জন্য কি ব্যবহার করতে চান👈🥀", "- মেনশন দিছেন কেন টাকা পাঠাবেন🥰 হাদিয়া দিতে চাইলে কিসের মাধ্যমে দিবেন জানাবেন 🥰 অবশ্যই স্ক্রিনশট রাখবেন🫂", "খুব দরকার হলে আবার মেনশন করেন 🥰","গ্রুপের কিছু জানার থাকলে দায়িত্বরত ব্যক্তিদের সাথে যোগাযোগ করুন 🥰","খুবই জরুরী হলে আবার মেনশন করুন 🥰","বুঝতে পারছি আপনার মোর্শেদ ভাইকে খুব দরকার তাই আবার মেনশন করুন 🥰","মোর্শেদ ভাই মনে হয় লাইনে নাই আবার মেনশন দিয়ে দেখতে পারেন🥰","মোর্শেদ ভাইয়ের সাথে গুরুত্বপূর্ণ কথা থাকলে আবার মেনশন করুন","মোরশেদ ভাইয়ের লাইনে নেই গ্রুপের নিয়ম সম্পর্কে জানতে চাইলে👉Rules👈 লিখুন 🥰 দরকার পড়লে আবার মেনশন করুন","আসসালামু আলাইকুম সহযোদ্ধা","আপনার বেশি দরকার হলে আবার মেনশন করুন 🥰","কিসের মাধ্যমে হাদিয়া পরিশোধ করতে চান🤗"];
      return api.sendMessage({body: msg[Math.floor(Math.random()*msg.length)]}, event.threadID, event.messageID);
    }
    }}
};
module.exports.run = async function({}) {
}
